; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=73, out_folder=htg/blocksworld/training, instance_id=53, seed=2077, goal_proportion=0.1

(define (problem blocksworld-53)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 - object)
 (:init 
    (arm-empty)
    (clear b41)
    (on b41 b47)
    (on b47 b46)
    (on b46 b72)
    (on b72 b39)
    (on b39 b22)
    (on-table b22)
    (clear b16)
    (on b16 b26)
    (on-table b26)
    (clear b14)
    (on b14 b21)
    (on b21 b50)
    (on-table b50)
    (clear b67)
    (on b67 b55)
    (on-table b55)
    (clear b58)
    (on-table b58)
    (clear b7)
    (on b7 b73)
    (on-table b73)
    (clear b34)
    (on-table b34)
    (clear b6)
    (on b6 b18)
    (on b18 b29)
    (on b29 b40)
    (on-table b40)
    (clear b28)
    (on-table b28)
    (clear b49)
    (on-table b49)
    (clear b4)
    (on b4 b23)
    (on b23 b68)
    (on b68 b71)
    (on b71 b33)
    (on-table b33)
    (clear b30)
    (on b30 b65)
    (on b65 b2)
    (on b2 b8)
    (on b8 b61)
    (on-table b61)
    (clear b48)
    (on b48 b53)
    (on-table b53)
    (clear b35)
    (on b35 b70)
    (on b70 b57)
    (on b57 b10)
    (on-table b10)
    (clear b13)
    (on b13 b25)
    (on b25 b19)
    (on b19 b63)
    (on-table b63)
    (clear b24)
    (on-table b24)
    (clear b69)
    (on b69 b62)
    (on-table b62)
    (clear b27)
    (on b27 b59)
    (on-table b59)
    (clear b15)
    (on b15 b17)
    (on b17 b64)
    (on b64 b31)
    (on b31 b43)
    (on-table b43)
    (clear b56)
    (on b56 b3)
    (on b3 b44)
    (on b44 b60)
    (on b60 b36)
    (on-table b36)
    (clear b66)
    (on b66 b11)
    (on-table b11)
    (clear b32)
    (on b32 b20)
    (on b20 b54)
    (on b54 b42)
    (on b42 b12)
    (on b12 b51)
    (on b51 b52)
    (on b52 b5)
    (on b5 b37)
    (on b37 b1)
    (on b1 b9)
    (on-table b9)
    (clear b38)
    (on b38 b45)
    (on-table b45))
 (:goal  (and 
    (clear b1)
    (on b1 b7)
    (on b7 b4)
    (on b4 b5)
    (on b5 b3)
    (on-table b3)
    (clear b6)
    (on b6 b2)
    (on-table b2))))

; plan
1. (unstack b7 b73)
   deleted: (on b7 b73) (clear b7) (arm-empty)
   added: (holding b7) (clear b73)
   goals met: 1 of 9
2. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 2 of 9
3. (unstack b56 b3)
   deleted: (on b56 b3) (clear b56) (arm-empty)
   added: (holding b56) (clear b3)
   goals met: 2 of 9
4. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 2 of 9
5. (unstack b3 b44)
   deleted: (on b3 b44) (clear b3) (arm-empty)
   added: (holding b3) (clear b44)
   goals met: 2 of 9
6. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 9
7. (unstack b30 b65)
   deleted: (on b30 b65) (clear b30) (arm-empty)
   added: (holding b30) (clear b65)
   goals met: 3 of 9
8. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 3 of 9
9. (unstack b65 b2)
   deleted: (on b65 b2) (clear b65) (arm-empty)
   added: (holding b65) (clear b2)
   goals met: 3 of 9
10. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 3 of 9
11. (unstack b6 b18)
   deleted: (on b6 b18) (clear b6) (arm-empty)
   added: (holding b6) (clear b18)
   goals met: 2 of 9
12. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 4 of 9
13. (unstack b32 b20)
   deleted: (on b32 b20) (clear b32) (arm-empty)
   added: (holding b32) (clear b20)
   goals met: 4 of 9
14. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 4 of 9
15. (unstack b20 b54)
   deleted: (on b20 b54) (clear b20) (arm-empty)
   added: (holding b20) (clear b54)
   goals met: 4 of 9
16. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 4 of 9
17. (unstack b54 b42)
   deleted: (on b54 b42) (clear b54) (arm-empty)
   added: (holding b54) (clear b42)
   goals met: 4 of 9
18. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 4 of 9
19. (unstack b42 b12)
   deleted: (on b42 b12) (clear b42) (arm-empty)
   added: (holding b42) (clear b12)
   goals met: 4 of 9
20. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 4 of 9
21. (unstack b12 b51)
   deleted: (on b12 b51) (clear b12) (arm-empty)
   added: (holding b12) (clear b51)
   goals met: 4 of 9
22. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 9
23. (unstack b51 b52)
   deleted: (on b51 b52) (clear b51) (arm-empty)
   added: (holding b51) (clear b52)
   goals met: 4 of 9
24. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 4 of 9
25. (unstack b52 b5)
   deleted: (on b52 b5) (clear b52) (arm-empty)
   added: (holding b52) (clear b5)
   goals met: 4 of 9
26. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 4 of 9
27. (unstack b5 b37)
   deleted: (on b5 b37) (clear b5) (arm-empty)
   added: (holding b5) (clear b37)
   goals met: 4 of 9
28. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 5 of 9
29. (unstack b37 b1)
   deleted: (on b37 b1) (clear b37) (arm-empty)
   added: (holding b37) (clear b1)
   goals met: 6 of 9
30. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 6 of 9
31. (unstack b1 b9)
   deleted: (on b1 b9) (clear b1) (arm-empty)
   added: (holding b1) (clear b9)
   goals met: 5 of 9
32. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 7 of 9
33. (unstack b6 b2)
   deleted: (on b6 b2) (clear b6) (arm-empty)
   added: (holding b6) (clear b2)
   goals met: 5 of 9
34. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 9
35. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 6 of 9
36. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 9
37. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 6 of 9
38. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 8 of 9
39. (unstack b1 b7)
   deleted: (on b1 b7) (clear b1) (arm-empty)
   added: (holding b1) (clear b7)
   goals met: 6 of 9
40. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 7 of 9
41. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 6 of 9
42. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 6 of 9
43. (unstack b4 b23)
   deleted: (on b4 b23) (clear b4) (arm-empty)
   added: (holding b4) (clear b23)
   goals met: 6 of 9
44. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 7 of 9
45. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 7 of 9
46. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 8 of 9
47. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 7 of 9
48. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 9 of 9
